#+TITLE: Git Introduction
#+AUTHOR: Daniel DeBruno
#+OPTIONS: toc:nil num:nil
#+REVEAL_INIT_OPTIONS: slideNumber:h/v
#+REVEAL_HLEVEL: 10
#+PROPERTIES: :exports code :eval no :session git

** Intro 2/2

Git has the idea of a remote place to store your git repos. One of these remote
places is github. While github uses git, git does not use github.

To get started we need to install git. Run this command to see if git is
installed already. If not follow the instructions according to your operating
system below (in windows search for the program git for bash to get the prompt).

#+BEGIN_SRC sh :exports both
git --version
#+END_SRC

#+RESULTS:
: git version 2.23.0

** Git Init
To get started run the command

#+BEGIN_SRC sh
git init myProject
#+END_SRC

#+RESULTS:
: Initialized empty Git repository in /home/archzix/Documents/compsciclub/myProject/.git/

This will give you a empty git repo called myProject. A repo is actually just a
folder for a project. You can now go into this folder and make a file called
readme.md. You can put in =Hello World= in the file as plain text.

#+BEGIN_SRC sh :exports none
cd myProject
touch readme.md
#+END_SRC

#+RESULTS:

